lst = [1, 2, 1, 3, 2, 5]
counts = {}

"""
    Проверка на всеки item от списъка, дали вече е въведен в речника {}.
    Ако е въведен, увеличи стойността на повторението с +=1
    Ако не е въведен го въвежда с counts[item] = 1 и речника вече изглежда така {item:1}
    по този начин, ще мине през всички числа от списъка и ще ги добави в речника,
    като ще сложи срещу всяко число броя на повторенията.
"""

for item in lst:
    if count[item] == 1:
        return item

""" Проверка за всеки item in lst, да провери в речника {item:n} -> count[item] == 1
    дали срещу item (числото), е = 1 или числото има повече повторения и не е уникално.
    Ако count[item] == 1 - връща item.
"""